public/man/man1/pw-loopback.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - pw-loopback.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - pw-loopback.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>pw-loopback - PipeWire loopback client</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>pw-loopback</strong> [/options/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <em>pw-loopback</em> program is a PipeWire client that uses the PipeWire
loopback module to create loopback nodes, with configuration given via
the command-line options.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-h | –help</strong></p>
<blockquote>
<p>Show help.</p>
</blockquote>
<p>
<strong>-r | –remote=NAME</strong></p>
<blockquote>
<p>The name of the <em>remote</em> instance to connect to. If left unspecified, a
connection is made to the default PipeWire instance.</p>
</blockquote>
<p>
<strong>-n | –name=NAME</strong></p>
<blockquote>
<p>Name of the loopback node</p>
</blockquote>
<p>
<strong>-g | –group=NAME</strong></p>
<blockquote>
<p>Name of the loopback node group</p>
</blockquote>
<p>
<strong>-c | –channels=NUMBER</strong></p>
<blockquote>
<p>Number of channels to provide</p>
</blockquote>
<p>
<strong>-m | –channel-map=MAP</strong></p>
<blockquote>
<p>Channel map (default [ FL, FR ])</p>
</blockquote>
<p>
<strong>-l | –latency=LATENCY</strong></p>
<blockquote>
<p>Desired latency in ms</p>
</blockquote>
<p>
<strong>-d | –delay=DELAY</strong></p>
<blockquote>
<p>Added delay in seconds (floating point allowed)</p>
</blockquote>
<p>
<strong>-C | –capture=TARGET</strong></p>
<blockquote>
<p>Target device to capture from</p>
</blockquote>
<p>
<strong>-P | –playback=TARGET</strong></p>
<blockquote>
<p>Target device to play to</p>
</blockquote>
<p>
<strong>–capture-props=PROPS</strong></p>
<blockquote>
<p>Wanted properties of capture node (in JSON)</p>
</blockquote>
<p>
<strong>–playback-props=PROPS</strong></p>
<blockquote>
<p>Wanted properties of capture node (in JSON)</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
AUTHORS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The PipeWire Developers
&lt;<a href="https://gitlab.freedesktop.org/pipewire/pipewire/issues">https://gitlab.freedesktop.org/pipewire/pipewire/issues</a>&gt;; PipeWire is
available from &lt;<a href="https://pipewire.org">https://pipewire.org</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><strong>pipewire(1)</strong>, <strong>pw-cat(1)</strong>, <strong>pactl(1)</strong></p>
<p>
Other ways to create loopback nodes are adding the loopback module in
the configuration of a PipeWire daemon, or loading the loopback module
using Pulseaudio commands (pactl load-module module-loopback …).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
